############
#   TAPS   #
############
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# tap "wfxr/csview"

###############
#  FORMULAS   #
###############
brew "antigen"
brew "neovim"
brew "pipx"
brew "pyenv"
brew "bat"
brew "git-delta"
brew "fzf"
brew "universal-ctags"
brew "exa"
brew "ripgrep-all"
brew "bottom"
brew "tmux"
brew "trash"

################
#   Services   #
################
brew "redis", restart_service: true

#############
#   FONTS   #
#############
cask "font-iosevka"
cask "font-iosevka-slab"
cask "font-jetbrains-mono"


############
#   APPS   #
############
cask "alacritty"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "keepassxc"
cask "mattermost"
cask "ngrok"

